keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_regdef.h
/** \\brief  Error/Debug Address Capture Register 10 */
typedef struct _Ifx_XBAR_ERRADDR10_Bits
{
    unsigned int ADDR:32;                   /**< \brief [31:0] Transaction Address (rh) */
} Ifx_XBAR_ERRADDR10_Bits;

/** \\brief  Error/Debug Address Capture Register */
typedef struct _Ifx_XBAR_ERRADDR_Bits
{
    unsigned int ADDR:32;                   /**< \brief [31:0] Transaction Address (rh) */
} Ifx_XBAR_ERRADDR_Bits;

/** \\brief  External Control Register D */
typedef struct _Ifx_XBAR_EXTCOND_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int WFWD:1;                    /**< \brief [3:3] Wait for FPI Write Data (rw) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int FREQDISF:1;                /**< \brief [6:6] Disable Fast Request Feature for FPI to SRI Transactions (rw) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int NODELTR:1;                 /**< \brief [9:9] Control Signal for deferred transactions (rw) */
    unsigned int NORMW:1;                   /**< \brief [10:10] Control Signal for deferred transactions (rw) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int MAX_WS:7;                  /**< \brief [19:13] FPI-Bus Wait State Retry Ratio (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_EXTCOND_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_XBAR_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_XBAR_ID_Bits;

/** \\brief  Transaction ID Interrupt Enable Register */
typedef struct _Ifx_XBAR_IDINTEN_Bits
{
    unsigned int ENSCI0:1;                  /**< \brief [0:0] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI1:1;                  /**< \brief [1:1] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI2:1;                  /**< \brief [2:2] Enable ID Error from SCIn (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int ENSCI4:1;                  /**< \brief [4:4] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI5:1;                  /**< \brief [5:5] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI6:1;                  /**< \brief [6:6] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI7:1;                  /**< \brief [7:7] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI8:1;                  /**< \brief [8:8] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI9:1;                  /**< \brief [9:9] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI10:1;                 /**< \brief [10:10] Enable ID Error from SCIn (rw) */
    unsigned int reserved_11:4;             /**< \brief \internal Reserved */
    unsigned int ENSCID:1;                  /**< \brief [15:15] Enable ID Error from Default Slave (rw) */
    unsigned int ENMCI0:1;                  /**< \brief [16:16] Enable ID Error from MCI0 (rw) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int ENMCI4:1;                  /**< \brief [20:20] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI5:1;                  /**< \brief [21:21] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI6:1;                  /**< \brief [22:22] Enable ID Error from MCIn (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int ENMCI8:1;                  /**< \brief [24:24] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI9:1;                  /**< \brief [25:25] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI10:1;                 /**< \brief [26:26] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI11:1;                 /**< \brief [27:27] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI12:1;                 /**< \brief [28:28] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI13:1;                 /**< \brief [29:29] Enable ID Error from MCIn (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTEN_Bits;

/** \\brief  Transaction ID Interrupt Status Register */
typedef struct _Ifx_XBAR_IDINTSAT_Bits
{
    unsigned int IDCSCI0:1;                 /**< \brief [0:0] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDCSCI1:1;                 /**< \brief [1:1] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDCSCI2:1;                 /**< \brief [2:2] Transaction ID Error from SCIn Status (rwh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int IDSCI4:1;                  /**< \brief [4:4] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI5:1;                  /**< \brief [5:5] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI6:1;                  /**< \brief [6:6] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI7:1;                  /**< \brief [7:7] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI8:1;                  /**< \brief [8:8] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI9:1;                  /**< \brief [9:9] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI10:1;                 /**< \brief [10:10] Transaction ID Error from SCIn Status (rwh) */
    unsigned int reserved_11:4;             /**< \brief \internal Reserved */
    unsigned int IDSCID:1;                  /**< \brief [15:15] Transaction ID Error from Default Slave Status (rwh) */
    unsigned int IDMCI0:1;                  /**< \brief [16:16] Transaction ID Error from MCI0 Status (rwh) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int IDMCI4:1;                  /**< \brief [20:20] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI5:1;                  /**< \brief [21:21] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI6:1;                  /**< \brief [22:22] Transaction ID Error from MCIn Status (rwh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int IDMCI8:1;                  /**< \brief [24:24] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI9:1;                  /**< \brief [25:25] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI10:1;                 /**< \brief [26:26] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI11:1;                 /**< \brief [27:27] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI12:1;                 /**< \brief [28:28] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI13:1;                 /**< \brief [29:29] Transaction ID Error from MCIn Status (rwh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTSAT_Bits;

/** \\brief  Arbiter Interrupt Status Register */
typedef struct _Ifx_XBAR_INTSAT_Bits
{
    unsigned int SCSCI0:1;                  /**< \brief [0:0] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI1:1;                  /**< \brief [1:1] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI2:1;                  /**< \brief [2:2] Starvation Error from SCIn Status (rwh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int SCSCI4:1;                  /**< \brief [4:4] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI5:1;                  /**< \brief [5:5] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI6:1;                  /**< \brief [6:6] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI7:1;                  /**< \brief [7:7] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI8:1;                  /**< \brief [8:8] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI9:1;                  /**< \brief [9:9] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI10:1;                 /**< \brief [10:10] Starvation Error from SCIn Status (rwh) */
    unsigned int reserved_11:4;             /**< \brief \internal Reserved */
    unsigned int SCSCID:1;                  /**< \brief [15:15] Starvation Error from Default Slave Status (rwh) */
    unsigned int PRSCI0:1;                  /**< \brief [16:16] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI1:1;                  /**< \brief [17:17] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI2:1;                  /**< \brief [18:18] Protocol Error from SCIn Status (rwh) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int PRSCI4:1;                  /**< \brief [20:20] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI5:1;                  /**< \brief [21:21] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI6:1;                  /**< \brief [22:22] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI7:1;                  /**< \brief [23:23] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI8:1;                  /**< \brief [24:24] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI9:1;                  /**< \brief [25:25] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI10:1;                 /**< \brief [26:26] Protocol Error from SCIn Status (rwh) */
    unsigned int reserved_27:4;             /**< \brief \internal Reserved */
    unsigned int PRSCID:1;                  /**< \brief [31:31] Protocol Error from Default Slave Status (rwh) */
} Ifx_XBAR_INTSAT_Bits;

