keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_regdef.h
/** \\brief  Arbiter Priority Register 10 */
typedef struct _Ifx_XBAR_PRIOH10_Bits
{
    unsigned int MASTER8:3;                 /**< \brief [2:0] Master 8 Priority (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int MASTER9:3;                 /**< \brief [6:4] Master 9 Priority (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int MASTER10:3;                /**< \brief [10:8] Master 10 Priority (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int MASTER11:3;                /**< \brief [14:12] Master 11 Priority (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int MASTER12:3;                /**< \brief [18:16] Master 12 Priority (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MASTER13:3;                /**< \brief [22:20] Master 13 Priority (rw) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOH10_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOH_Bits
{
    unsigned int MASTER8:3;                 /**< \brief [2:0] Master 8 Priority (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int MASTER9:3;                 /**< \brief [6:4] Master 9 Priority (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int MASTER10:3;                /**< \brief [10:8] Master 10 Priority (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int MASTER11:3;                /**< \brief [14:12] Master 11 Priority (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int MASTER12:3;                /**< \brief [18:16] Master 12 Priority (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MASTER13:3;                /**< \brief [22:20] Master 13 Priority (rw) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOH_Bits;

/** \\brief  Arbiter Priority Register 10 */
typedef struct _Ifx_XBAR_PRIOL10_Bits
{
    unsigned int MASTER0:3;                 /**< \brief [2:0] Master 0 Priority (rw) */
    unsigned int reserved_3:13;             /**< \brief \internal Reserved */
    unsigned int MASTER4:3;                 /**< \brief [18:16] Master 4 Priority (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MASTER5:3;                 /**< \brief [22:20] Master 5 Priority (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int MASTER6:3;                 /**< \brief [26:24] Master 6 Priority (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOL10_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOL_Bits
{
    unsigned int MASTER0:3;                 /**< \brief [2:0] Master 0 Priority (rw) */
    unsigned int reserved_3:13;             /**< \brief \internal Reserved */
    unsigned int MASTER4:3;                 /**< \brief [18:16] Master 4 Priority (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MASTER5:3;                 /**< \brief [22:20] Master 5 Priority (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int MASTER6:3;                 /**< \brief [26:24] Master 6 Priority (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ACCEN0_Bits B;
} Ifx_XBAR_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ACCEN1_Bits B;
} Ifx_XBAR_ACCEN1;

/** \\brief  Arbiter Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBCON_Bits B;
} Ifx_XBAR_ARBCON;

/** \\brief  Arbiter Control Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBCON10_Bits B;
} Ifx_XBAR_ARBCON10;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER0_DBADD_Bits B;
} Ifx_XBAR_ARBITER0_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER0_DBMADD_Bits B;
} Ifx_XBAR_ARBITER0_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER1_DBADD_Bits B;
} Ifx_XBAR_ARBITER1_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER1_DBMADD_Bits B;
} Ifx_XBAR_ARBITER1_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER2_DBADD_Bits B;
} Ifx_XBAR_ARBITER2_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER2_DBMADD_Bits B;
} Ifx_XBAR_ARBITER2_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER4_DBADD_Bits B;
} Ifx_XBAR_ARBITER4_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER4_DBMADD_Bits B;
} Ifx_XBAR_ARBITER4_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER5_DBADD_Bits B;
} Ifx_XBAR_ARBITER5_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER5_DBMADD_Bits B;
} Ifx_XBAR_ARBITER5_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER6_DBADD_Bits B;
} Ifx_XBAR_ARBITER6_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER6_DBMADD_Bits B;
} Ifx_XBAR_ARBITER6_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER7_DBADD_Bits B;
} Ifx_XBAR_ARBITER7_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER7_DBMADD_Bits B;
} Ifx_XBAR_ARBITER7_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER8_DBADD_Bits B;
} Ifx_XBAR_ARBITER8_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER8_DBMADD_Bits B;
} Ifx_XBAR_ARBITER8_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER9_DBADD_Bits B;
} Ifx_XBAR_ARBITER9_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER9_DBMADD_Bits B;
} Ifx_XBAR_ARBITER9_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITERD_DBADD_Bits B;
} Ifx_XBAR_ARBITERD_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITERD_DBMADD_Bits B;
} Ifx_XBAR_ARBITERD_DBMADD;

/** \\brief  Debug Address Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBADD10_Bits B;
} Ifx_XBAR_DBADD10;

/** \\brief  Debug Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBCON_Bits B;
} Ifx_XBAR_DBCON;

/** \\brief  Debug Control Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBCON10_Bits B;
} Ifx_XBAR_DBCON10;

/** \\brief  Debug Mask Address Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBMADD10_Bits B;
} Ifx_XBAR_DBMADD10;

/** \\brief  Debug Trigger Event Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBSAT_Bits B;
} Ifx_XBAR_DBSAT;

/** \\brief  Error/Debug Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERR_Bits B;
} Ifx_XBAR_ERR;

/** \\brief  Error/Debug Capture Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERR10_Bits B;
} Ifx_XBAR_ERR10;

/** \\brief  Error/Debug Address Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERRADDR_Bits B;
} Ifx_XBAR_ERRADDR;

