keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_regdef.h
/** \\brief  Error/Debug Address Capture Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERRADDR10_Bits B;
} Ifx_XBAR_ERRADDR10;

/** \\brief  External Control Register D */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_EXTCOND_Bits B;
} Ifx_XBAR_EXTCOND;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ID_Bits B;
} Ifx_XBAR_ID;

/** \\brief  Transaction ID Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_IDINTEN_Bits B;
} Ifx_XBAR_IDINTEN;

/** \\brief  Transaction ID Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_IDINTSAT_Bits B;
} Ifx_XBAR_IDINTSAT;

/** \\brief  Arbiter Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_INTSAT_Bits B;
} Ifx_XBAR_INTSAT;

/** \\brief  Arbiter Priority Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_PRIOH_Bits B;
} Ifx_XBAR_PRIOH;

/** \\brief  Arbiter Priority Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_PRIOH10_Bits B;
} Ifx_XBAR_PRIOH10;

/** \\brief  Arbiter Priority Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_PRIOL_Bits B;
} Ifx_XBAR_PRIOL;

/** \\brief  Arbiter Priority Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_PRIOL10_Bits B;
} Ifx_XBAR_PRIOL10;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER0
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER0_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER0_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER0;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER1
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER1_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER1_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER1;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER2
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER2_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER2_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER2;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER4
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER4_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER4_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER4;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER5
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER5_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER5_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER5;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER6
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER6_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER6_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER6;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER7
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER7_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER7_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER7;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER8
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER8_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER8_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER8;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER9
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER9_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER9_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER9;

/** \\brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITERD
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITERD_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITERD_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITERD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

