keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_regdef.h
/** \\brief  XBAR object */
typedef volatile struct _Ifx_XBAR
{
    Ifx_XBAR_EXTCOND EXTCOND;               /**< \brief 0, External Control Register D */
    Ifx_XBAR_ARBITERD ARBITERD;             /**< \brief 4, Arbiter objects */
    unsigned char reserved_24[32];          /**< \brief 24, \internal Reserved */
    Ifx_XBAR_ARBITER0 ARBITER0;             /**< \brief 44, Arbiter objects */
    unsigned char reserved_64[32];          /**< \brief 64, \internal Reserved */
    Ifx_XBAR_ARBITER1 ARBITER1;             /**< \brief 84, Arbiter objects */
    unsigned char reserved_A4[32];          /**< \brief A4, \internal Reserved */
    Ifx_XBAR_ARBITER2 ARBITER2;             /**< \brief C4, Arbiter objects */
    unsigned char reserved_E4[96];          /**< \brief E4, \internal Reserved */
    Ifx_XBAR_ARBITER4 ARBITER4;             /**< \brief 144, Arbiter objects */
    unsigned char reserved_164[32];         /**< \brief 164, \internal Reserved */
    Ifx_XBAR_ARBITER5 ARBITER5;             /**< \brief 184, Arbiter objects */
    unsigned char reserved_1A4[32];         /**< \brief 1A4, \internal Reserved */
    Ifx_XBAR_ARBITER6 ARBITER6;             /**< \brief 1C4, Arbiter objects */
    unsigned char reserved_1E4[32];         /**< \brief 1E4, \internal Reserved */
    Ifx_XBAR_ARBITER7 ARBITER7;             /**< \brief 204, Arbiter objects */
    unsigned char reserved_224[32];         /**< \brief 224, \internal Reserved */
    Ifx_XBAR_ARBITER8 ARBITER8;             /**< \brief 244, Arbiter objects */
    unsigned char reserved_264[32];         /**< \brief 264, \internal Reserved */
    Ifx_XBAR_ARBITER9 ARBITER9;             /**< \brief 284, Arbiter objects */
    unsigned char reserved_2A4[32];         /**< \brief 2A4, \internal Reserved */
    Ifx_XBAR_ARBCON10 ARBCON10;             /**< \brief 2C4, Arbiter Control Register 10 */
    Ifx_XBAR_PRIOH10 PRIOH10;               /**< \brief 2C8, Arbiter Priority Register 10 */
    Ifx_XBAR_PRIOL10 PRIOL10;               /**< \brief 2CC, Arbiter Priority Register 10 */
    Ifx_XBAR_ERRADDR10 ERRADDR10;           /**< \brief 2D0, Error/Debug Address Capture Register 10 */
    Ifx_XBAR_ERR10 ERR10;                   /**< \brief 2D4, Error/Debug Capture Register 10 */
    Ifx_XBAR_DBCON10 DBCON10;               /**< \brief 2D8, Debug Control Register 10 */
    Ifx_XBAR_DBADD10 DBADD10;               /**< \brief 2DC, Debug Address Register 10 */
    Ifx_XBAR_DBMADD10 DBMADD10;             /**< \brief 2E0, Debug Mask Address Register 10 */
    unsigned char reserved_2E4[292];        /**< \brief 2E4, \internal Reserved */
    Ifx_XBAR_ID ID;                         /**< \brief 408, Module Identification Register */
    Ifx_XBAR_DBSAT DBSAT;                   /**< \brief 40C, Debug Trigger Event Status Register */
    Ifx_XBAR_INTSAT INTSAT;                 /**< \brief 410, Arbiter Interrupt Status Register */
    Ifx_XBAR_IDINTSAT IDINTSAT;             /**< \brief 414, Transaction ID Interrupt Status Register */
    Ifx_XBAR_IDINTEN IDINTEN;               /**< \brief 418, Transaction ID Interrupt Enable Register */
    unsigned char reserved_41C[220];        /**< \brief 41C, \internal Reserved */
    Ifx_XBAR_ACCEN1 ACCEN1;                 /**< \brief 4F8, Access Enable Register 1 */
    Ifx_XBAR_ACCEN0 ACCEN0;                 /**< \brief 4FC, Access Enable Register 0 */
} Ifx_XBAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXXBAR_REGDEF_H */
